MPU Messenger/MPU Messenger/bin/Debug/MPU Mesajları/0001-Client To MPU AddVariables Request Message.txt

<?xml version="1.0" encoding="utf-8"?>
    <soap:Envelope
        xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <soap:Body>
            <AddVariables
                xmlns="http://transport.alstom.com/webservices/extendedSymbolism">
                <SetOfVariablesToAdd>
                    <VariableToAdd>
                        <SymbolicName>
                            /MPU_taskmpu/drs1/open_ext_drs1/mpu_open_ext_drs1/doors_open_autho_left_side_Fault_A1/zIOS_Evt
                            </SymbolicName>
                        <ProdId>
                            1
                            </ProdId>
                        <Size>
                            1
                            </Size>
                        <Type>
                            TBOOL
                            </Type>
                        <Reference>
                            6048
                            </Reference>
                        <ReferenceCB>
                            0
                            </ReferenceCB>
                        </VariableToAdd>
                    <VariableToAdd>
                        <SymbolicName>
                            /MPU_taskmpu/drs1/open_ext_drs1/mpu_open_ext_drs1/doors_open_autho_left_side_Fault_A1/zIOSAckSingle
                            </SymbolicName>
                        <ProdId>
                            1
                            </ProdId>
                        <Size>
                            1
                            </Size>
                        <Type>
                            TBOOL
                            </Type>
                        <Reference>
                            6050
                            </Reference>
                        <ReferenceCB>
                            0
                            </ReferenceCB>
                        </VariableToAdd>
                    <VariableToAdd>
                        <SymbolicName>
                            /MPU_taskmpu/drs1/VB_DRS_DoorOpen_B1
                            </SymbolicName>
                        <ProdId>
                            1
                            </ProdId>
                        <Size>
                            1
                            </Size>
                        <Type>
                            TBOOL
                            </Type>
                        <Reference>
                            4356
                            </Reference>
                        <ReferenceCB>
                            0
                            </ReferenceCB>
                        </VariableToAdd>
                    <VariableToAdd>
                        <SymbolicName>
                            /MPU_taskmpu/drs1/VB_DRS_DoorOpen_A1
                            </SymbolicName>
                        <ProdId>
                            1
                            </ProdId>
                        <Size>
                            1
                            </Size>
                        <Type>
                            TBOOL
                            </Type>
                        <Reference>
                            4355
                            </Reference>
                        <ReferenceCB>
                            0
                            </ReferenceCB>
                        </VariableToAdd>
                    <VariableToAdd>
                        <SymbolicName>
                            /MPU_taskmpu/drs1/VB_DRS_DoorOpen_A2
                            </SymbolicName>
                        <ProdId>
                            1
                            </ProdId>
                        <Size>
                            1
                            </Size>
                        <Type>
                            TBOOL
                            </Type>
                        <Reference>
                            4358
                            </Reference>
                        <ReferenceCB>
                            0
                            </ReferenceCB>
                        </VariableToAdd>
                    <VariableToAdd>
                        <SymbolicName>
                            /MPU_taskmpu/drs1/VB_DRS_DoorOpen_C1
                            </SymbolicName>
                        <ProdId>
                            1
                            </ProdId>
                        <Size>
                            1
                            </Size>
                        <Type>
                            TBOOL
                            </Type>
                        <Reference>
                            4357
                            </Reference>
                        <ReferenceCB>
                            0
                            </ReferenceCB>
                        </VariableToAdd>
                    <VariableToAdd>
                        <SymbolicName>
                            /MPU_taskmpu/drs1/open_ext_drs1/mpu_open_ext_drs1/VB_DRS_OpenDoorsRight
                            </SymbolicName>
                        <ProdId>
                            1
                            </ProdId>
                        <Size>
                            1
                            </Size>
                        <Type>
                            TBOOL
                            </Type>
                        <Reference>
                            4410
                            </Reference>
                        <ReferenceCB>
                            0
                            </ReferenceCB>
                        </VariableToAdd>
                    <VariableToAdd>
                        <SymbolicName>
                            /MPU_taskmpu/drs1/open_ext_drs1/VB_DRS_OpenDoorsLeft
                            </SymbolicName>
                        <ProdId>
                            1
                            </ProdId>
                        <Size>
                            1
                            </Size>
                        <Type>
                            TBOOL
                            </Type>
                        <Reference>
                            4409
                            </Reference>
                        <ReferenceCB>
                            0
                            </ReferenceCB>
                        </VariableToAdd>
                    <VariableToAdd>
                        <SymbolicName>
                            /MPU_taskmpu/pai1/trigger_automatic_msg1/mpu_manage_distance_counter/VB_DRS_TLLeftDrsReleased
                            </SymbolicName>
                        <ProdId>
                            1
                            </ProdId>
                        <Size>
                            1
                            </Size>
                        <Type>
                            TBOOL
                            </Type>
                        <Reference>
                            4182
                            </Reference>
                        <ReferenceCB>
                            0
                            </ReferenceCB>
                        </VariableToAdd>
                    <VariableToAdd>
                        <SymbolicName>
                            /MPU_taskmpu/drs1/release_ext_drs2/mpu_rel_ext_drs_trainline1/VB_DRS_TLLeftDrsReleased
                            </SymbolicName>
                        <ProdId>
                            1
                            </ProdId>
                        <Size>
                            1
                            </Size>
                        <Type>
                            TBOOL
                            </Type>
                        <Reference>
                            4182
                            </Reference>
                        <ReferenceCB>
                            0
                            </ReferenceCB>
                        </VariableToAdd>
                    <VariableToAdd>
                        <SymbolicName>
                            /MPU_taskmpu/drs1/release_ext_drs2/mpu_rel_ext_drs_trainline1/VB_DRS_TLRightDrsReleased
                            </SymbolicName>
                        <ProdId>
                            1
                            </ProdId>
                        <Size>
                            1
                            </Size>
                        <Type>
                            TBOOL
                            </Type>
                        <Reference>
                            4181
                            </Reference>
                        <ReferenceCB>
                            0
                            </ReferenceCB>
                        </VariableToAdd>
                    <VariableToAdd>
                        <SymbolicName>
                            /MPU_taskmpu/tcn1/tcn_monitor1/tcn_monitor_can_eqt/VB_TCN_DCU7Oper_A1
                            </SymbolicName>
                        <ProdId>
                            1
                            </ProdId>
                        <Size>
                            1
                            </Size>
                        <Type>
                            TBOOL
                            </Type>
                        <Reference>
                            4090
                            </Reference>
                        <ReferenceCB>
                            0
                            </ReferenceCB>
                        </VariableToAdd>
                    <VariableToAdd>
                        <SymbolicName>
                            /MPU_taskmpu/drs1/VB_TCN_DCU7ComOk_A1
                            </SymbolicName>
                        <ProdId>
                            1
                            </ProdId>
                        <Size>
                            1
                            </Size>
                        <Type>
                            TBOOL
                            </Type>
                        <Reference>
                            4090
                            </Reference>
                        <ReferenceCB>
                            0
                            </ReferenceCB>
                        </VariableToAdd>
                    <VariableToAdd>
                        <SymbolicName>
                            /MPU_taskmpu/tcn1/VB_TCN_DCU7ComOk_A1
                            </SymbolicName>
                        <ProdId>
                            1
                            </ProdId>
                        <Size>
                            1
                            </Size>
                        <Type>
                            TBOOL
                            </Type>
                        <Reference>
                            4090
                            </Reference>
                        <ReferenceCB>
                            0
                            </ReferenceCB>
                        </VariableToAdd>
                    </SetOfVariablesToAdd>
                </AddVariables>
            </soap:Body>
        </soap:Envelope>
